yong1214/qemu-esp32/hw/gpio/gpio_timing_executor.c
/*
 * GPIO Timing-Protocol Executor (GTPE) — QEMU ESP32
 *
 * Data-driven virtual GPIO device engine. Reads JSON timing scripts
 * at startup and uses QEMU_CLOCK_VIRTUAL timers for cycle-accurate
 * pin responses.
 *
 * Copyright (c) 2025-2026 Dustalon Project
 */

#include "qemu/osdep.h"
#include "qemu/log.h"
#include "qemu/timer.h"
#include "hw/gpio/gpio_timing_executor.h"
#include "hw/gpio/esp32_gpio.h"

#include "qapi/qmp/qjson.h"
#include "qapi/qmp/qobject.h"
#include "qapi/qmp/qdict.h"
#include "qapi/qmp/qlist.h"
#include "qapi/qmp/qnum.h"
#include "qapi/qmp/qstring.h"
#include "qapi/qmp/qbool.h"
#include "qapi/error.h"

#include <string.h>
#include <math.h>

/* ── Forward declarations ────────────────────────────────────────────────── */

static void gte_step_callback(void *opaque);
static void gte_trigger_cb(void *opaque, int pin, bool high);

/* ── Waveform Emission (Oscilloscope) ────────────────────────────────────── */

/**
 * Emit a SCOPE_EVT line to stdout so the frontend oscilloscope can display
 * GTPE-driven waveforms. QEMU uses -serial stdio, so stdout is captured
 * by the Node.js backend alongside UART output.
 */
static void gte_emit_waveform(GteDevice *dev, int pin_index, int level,
                               const char *phase, const char *edge,
                               const char *label)
{
    if (!dev->emit_waveform) return;

    int pin_num = (pin_index >= 0 && pin_index < dev->num_drive_pins)
                  ? dev->drive_pins[pin_index]
                  : dev->watch_pin;
    int channel = dev->device_index * 100 + (pin_index >= 0 ? pin_index : 0);

    uint64_t time_ns = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL);

    if (label) {
        fprintf(stdout, "SCOPE_EVT pin=%d channel=%d level=%d time=%"PRIu64
                " phase=%s edge=%s label=%s\n",
                pin_num, channel, level, time_ns, phase, edge, label);
    } else {
        fprintf(stdout, "SCOPE_EVT pin=%d channel=%d level=%d time=%"PRIu64
                " phase=%s edge=%s\n",
                pin_num, channel, level, time_ns, phase, edge);
    }
    fflush(stdout);
}

/* ── Data Encoders ───────────────────────────────────────────────────────── */

static void gte_encode_dht11(GteDevice *dev)
{
    float temp = dev->params[0]; /* temperature */
    float hum  = dev->params[1]; /* humidity */

    /* Apply noise if params exist */
    if (dev->num_params > 2 && dev->params[2] > 0) {
        temp += (float)g_random_double_range(-dev->params[2], dev->params[2]);
    }
    if (dev->num_params > 3 && dev->params[3] > 0) {
        hum += (float)g_random_double_range(-dev->params[3], dev->params[3]);
    }

    /* Clamp to DHT11 range */
    if (temp < 0) temp = 0; if (temp > 50) temp = 50;
    if (hum < 20) hum = 20; if (hum > 90) hum = 90;

    uint8_t hum_int  = (uint8_t)hum;
    uint8_t hum_dec  = 0;
    uint8_t temp_int = (uint8_t)temp;
    uint8_t temp_dec = 0;

    dev->data_bytes[0] = hum_int;
    dev->data_bytes[1] = hum_dec;
    dev->data_bytes[2] = temp_int;
    dev->data_bytes[3] = temp_dec;
    dev->data_bytes[4] = (hum_int + hum_dec + temp_int + temp_dec) & 0xFF;
    dev->data_bit_count = 40;
}

void gte_encode_data(GteDevice *dev)
{
    switch (dev->encoder_type) {
    case GTE_ENCODER_DHT11_40BIT:
        gte_encode_dht11(dev);
        break;
    case GTE_ENCODER_RAW_PULSE:
    case GTE_ENCODER_NONE:
    default:
        break;
    }
}

/* ── Delay Computation ───────────────────────────────────────────────────── */

static uint64_t gte_compute_delay_ns(GteDevice *dev, const GteStep *step)
{
    switch (step->type) {
    case GTE_STEP_SET_PIN:
    case GTE_STEP_COMMENT:
        return step->delay_ns;

    case GTE_STEP_SET_PIN_EXPR: {
        float val = 0;
        int idx = step->delay_expr.param_index;
        if (idx >= 0 && idx < dev->num_params) {
            val = dev->params[idx];
        }
        /* Apply noise for HC-SR04 distance */
        if (dev->num_params > idx + 1 && dev->params[idx + 1] > 0) {
            val += (float)g_random_double_range(
                -dev->params[idx + 1], dev->params[idx + 1]);
            if (val < 2.0f) val = 2.0f; /* HC-SR04 min range */
        }
        float delay_us = val * step->delay_expr.multiplier;
        if (delay_us < 0) delay_us = 0;
        return (uint64_t)(delay_us * 1000.0f); /* µs → ns */
    }

    case GTE_STEP_SET_PIN_BIT: {
        /* Look up current data bit */
        if (dev->current_bit < dev->data_bit_count) {
            int byte_idx = dev->current_bit / 8;
            int bit_idx  = 7 - (dev->current_bit % 8); /* MSB first */
            bool bit_val = (dev->data_bytes[byte_idx] >> bit_idx) & 1;
            return bit_val ? step->delay_bit[1] : step->delay_bit[0];
        }
        return step->delay_bit[0]; /* fallback */
    }

    default:
        return 0;
    }
}

/* ── Timeline Precomputation (read-interception approach) ────────────────── */

/**
 * Build a precomputed timeline of all pin state changes with absolute
 * virtual-time stamps. Called once per trigger. During GPIO_IN reads,
 * we binary-search this timeline to return the correct pin state.
 */
static void gte_build_timeline(GteDevice *dev, uint64_t start_ns)
{
    dev->timeline_count = 0;
    dev->response_start_ns = start_ns;

    uint64_t current_ns = start_ns;
    int step_idx = 0;
    int repeat_counter = 0;
    int repeat_start = 0;
    int bit = 0;

    while (step_idx < dev->num_steps &&
           dev->timeline_count < GTE_MAX_TIMELINE) {
        GteStep *step = &dev->steps[step_idx];

        switch (step->type) {
        case GTE_STEP_COMMENT:
            step_idx++;
            break;

        case GTE_STEP_SET_PIN:
            current_ns += step->delay_ns;
            dev->timeline[dev->timeline_count].time_ns = current_ns;
            dev->timeline[dev->timeline_count].pin_index = step->pin_index;
            dev->timeline[dev->timeline_count].pin_value = step->pin_value;
            dev->timeline_count++;
            step_idx++;
            break;

        case GTE_STEP_SET_PIN_EXPR: {
            float val = 0;
            int idx = step->delay_expr.param_index;
            if (idx >= 0 && idx < dev->num_params) {
                val = dev->params[idx];
            }
            if (dev->num_params > idx + 1 && dev->params[idx + 1] > 0) {
                val += (float)g_random_double_range(
                    -dev->params[idx + 1], dev->params[idx + 1]);
                if (val < 2.0f) val = 2.0f;
            }
            float delay_us = val * step->delay_expr.multiplier;
            if (delay_us < 0) delay_us = 0;
            current_ns += (uint64_t)(delay_us * 1000.0f);
            dev->timeline[dev->timeline_count].time_ns = current_ns;
            dev->timeline[dev->timeline_count].pin_index = step->pin_index;
            dev->timeline[dev->timeline_count].pin_value = step->pin_value;
            dev->timeline_count++;
            step_idx++;
            break;
        }

