yong1214/qemu-esp32/hw/gpio/gpio_timing_executor.c
        case GTE_STEP_SET_PIN_BIT: {
            if (bit < dev->data_bit_count) {
                int byte_idx = bit / 8;
                int bit_idx = 7 - (bit % 8);
                bool bit_val = (dev->data_bytes[byte_idx] >> bit_idx) & 1;
                current_ns += bit_val ? step->delay_bit[1] : step->delay_bit[0];
            } else {
                current_ns += step->delay_bit[0];
            }
            dev->timeline[dev->timeline_count].time_ns = current_ns;
            dev->timeline[dev->timeline_count].pin_index = step->pin_index;
            dev->timeline[dev->timeline_count].pin_value = step->pin_value;
            dev->timeline_count++;
            bit++;
            step_idx++;
            break;
        }

        case GTE_STEP_REPEAT_START:
            /* repeat_count == -1 means "encoded_bits": repeat for each
             * data bit produced by the encoder (e.g., 40 for DHT11) */
            repeat_counter = (step->repeat_count == -1)
                             ? dev->data_bit_count
                             : step->repeat_count;
            repeat_start = step_idx + 1;
            bit = 0; /* reset bit index for bit-encoded sequences */
            step_idx++;
            break;

        case GTE_STEP_REPEAT_END:
            repeat_counter--;
            if (repeat_counter > 0) {
                step_idx = repeat_start;
            } else {
                step_idx++;
            }
            break;

        default:
            step_idx++;
            break;
        }
    }

    qemu_log("GTPE '%s': built timeline (%d entries, %"PRIu64"us total)\n",
             dev->name, dev->timeline_count,
             dev->timeline_count > 0
                 ? (dev->timeline[dev->timeline_count - 1].time_ns - start_ns) / 1000
                 : 0);

    /* Emit all timeline edges as SCOPE_EVT for oscilloscope.
     * Since the timeline is precomputed, emit all events now with their
     * relative timestamps. The frontend accumulates them. */
    if (dev->emit_waveform && dev->timeline_count > 0) {
        uint64_t base_ns = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL);
        for (int i = 0; i < dev->timeline_count; i++) {
            GteTimelineEntry *te = &dev->timeline[i];
            int pin_num = (te->pin_index >= 0 && te->pin_index < dev->num_drive_pins)
                          ? dev->drive_pins[te->pin_index] : dev->watch_pin;
            int channel = dev->device_index * 100 +
                          (te->pin_index >= 0 ? te->pin_index : 0);
            /* Use base_ns + relative offset as timestamp */
            uint64_t t = base_ns + te->time_ns - start_ns;
            fprintf(stdout, "SCOPE_EVT pin=%d channel=%d level=%d time=%"PRIu64
                    " phase=edge edge=%s\n",
                    pin_num, channel, te->pin_value ? 1 : 0, t,
                    te->pin_value ? "rising" : "falling");
        }
        /* Emit complete event for each drive pin */
        for (int i = 0; i < dev->num_drive_pins; i++) {
            int pin_num = dev->drive_pins[i];
            int channel = dev->device_index * 100 + i;
            uint64_t t_end = base_ns +
                dev->timeline[dev->timeline_count - 1].time_ns - start_ns;
            fprintf(stdout, "SCOPE_EVT pin=%d channel=%d level=0 time=%"PRIu64
                    " phase=complete edge=none\n",
                    pin_num, channel, t_end);
        }
        fflush(stdout);
    }
}

/* Public wrapper — called by RMT peripheral to build timeline without
 * modifying trigger/active state.
 * Suppress SCOPE_EVT emission here — the GPIO trigger path already emitted. */
void gte_build_timeline_for_rmt(GteDevice *dev, uint64_t start_ns)
{
    bool saved = dev->emit_waveform;
    dev->emit_waveform = false;
    gte_build_timeline(dev, start_ns);
    dev->emit_waveform = saved;
}

/**
 * Apply GTPE read interception to GPIO_IN register value.
 * For each active device, find the correct pin state at the current
 * virtual time by searching the precomputed timeline.
 */
uint32_t gte_apply_read_intercept(uint32_t in_val, int bank,
                                   GteDevice *devices, int count)
{
    if (!devices || count <= 0) return in_val;

    /*
     * NS_PER_READ: how many nanoseconds of "protocol time" each GPIO_IN
     * read represents. On real ESP32 at 240MHz, a tight digitalRead +
     * micros() + branch loop is ~30-50 cycles ≈ 125-210ns.
     *
     * In QEMU without icount, each GPIO_IN MMIO read takes ~30-90µs of
     * virtual time, but we IGNORE virtual time. Instead, we count reads
     * and multiply by NS_PER_READ to get protocol-relative time.
     *
     * This is the same approach as Renode's DHT11 (US_PER_IDR_READ=0.1µs).
     */
    #define NS_PER_READ 150  /* 0.15µs per read ≈ 36 cycles at 240MHz */

    for (int d = 0; d < count; d++) {
        GteDevice *dev = &devices[d];
        if (!dev->active || dev->timeline_count == 0) continue;

        /* On first GPIO_IN read after trigger: anchor */
        if (dev->pending_response) {
            dev->pending_response = false;
            dev->read_count = 0;
            dev->response_start_ns = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL);
            qemu_log("GTPE '%s': anchored (read-count mode, %d entries)\n",
                     dev->name, dev->timeline_count);
        }

        /* Protocol-relative elapsed time based on read count */
        uint64_t elapsed_ns = (uint64_t)dev->read_count * NS_PER_READ;
        dev->read_count++;

        /* Check if response has ended */
        uint64_t end_ns = dev->timeline[dev->timeline_count - 1].time_ns;
        if (elapsed_ns > end_ns + 100000) {
            dev->active = false;
            for (int i = 0; i < dev->num_drive_pins; i++) {
                int pin = dev->drive_pins[i];
                int pin_bank = (pin >= 32) ? 1 : 0;
                if (pin_bank == bank) {
                    int bit = pin & 31;
                    if (dev->idle_values[i])
                        in_val |= (1u << bit);
                    else
                        in_val &= ~(1u << bit);
                }
            }
            continue;
        }

