yong1214/qemu-esp32/hw/gpio/gpio_timing_executor.c
        /* For each driven pin, find latest timeline entry <= elapsed_ns */
        for (int i = 0; i < dev->num_drive_pins; i++) {
            int pin = dev->drive_pins[i];
            int pin_bank = (pin >= 32) ? 1 : 0;
            if (pin_bank != bank) continue;

            int found_value = dev->idle_values[i];
            for (int t = dev->timeline_count - 1; t >= 0; t--) {
                if (dev->timeline[t].time_ns <= elapsed_ns &&
                    dev->timeline[t].pin_index == i) {
                    found_value = dev->timeline[t].pin_value;
                    break;
                }
            }

            int bit = pin & 31;
            if (found_value)
                in_val |= (1u << bit);
            else
                in_val &= ~(1u << bit);
        }
    }

    return in_val;
}

/* ── Step Execution (timer-based, kept for compatibility) ────────────────── */

static void gte_execute_step(GteDevice *dev)
{
    if (!dev->active || !dev->gpio) return;
    if (dev->current_step >= dev->num_steps) {
        /* Sequence complete — set idle state */
        for (int i = 0; i < dev->num_drive_pins; i++) {
            esp32_gpio_set_input_level(dev->gpio, dev->drive_pins[i],
                                       dev->idle_values[i] != 0);
            gte_emit_waveform(dev, i, 0, "complete", "none", NULL);
        }
        dev->active = false;
        return;
    }

    GteStep *step = &dev->steps[dev->current_step];

    switch (step->type) {
    case GTE_STEP_COMMENT:
        /* Skip to next step immediately */
        dev->current_step++;
        gte_execute_step(dev);
        return;

    case GTE_STEP_SET_PIN:
    case GTE_STEP_SET_PIN_EXPR:
    case GTE_STEP_SET_PIN_BIT: {
        uint64_t delay_ns = gte_compute_delay_ns(dev, step);

        /* For bit steps, advance the bit counter */
        if (step->type == GTE_STEP_SET_PIN_BIT) {
            dev->current_bit++;
        }

        dev->current_step++;

        /* Schedule pin change after delay */
        if (delay_ns > 0) {
            uint64_t now_ns = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL);
            if (dev->current_step <= 8) {
                qemu_log("GTPE '%s': scheduling step[%d] delay_ns=%"PRIu64
                         " (=%"PRIu64"us) at vtime=%"PRIu64"us\n",
                         dev->name, dev->current_step - 1,
                         delay_ns, delay_ns / 1000, now_ns / 1000);
            }
            timer_mod_ns(dev->step_timer, now_ns + delay_ns);
        } else {
            /* Zero delay — execute immediately */
            gte_step_callback(dev);
        }
        return;
    }

    case GTE_STEP_REPEAT_START:
        dev->repeat_counter = (step->repeat_count == -1)
                              ? dev->data_bit_count
                              : step->repeat_count;
        dev->repeat_start_step = dev->current_step + 1;
        dev->current_bit = 0; /* reset bit index */
        dev->current_step++;
        gte_execute_step(dev);
        return;

    case GTE_STEP_REPEAT_END:
        dev->repeat_counter--;
        if (dev->repeat_counter > 0) {
            dev->current_step = dev->repeat_start_step;
        } else {
            dev->current_step++;
        }
        gte_execute_step(dev);
        return;

    default:
        dev->current_step++;
        gte_execute_step(dev);
        return;
    }
}

static void gte_step_callback(void *opaque)
{
    GteDevice *dev = (GteDevice *)opaque;
    if (!dev->active || !dev->gpio) return;

    /* The previous step scheduled us — execute its pin change.
     * The step index was already advanced, so look at step - 1. */
    int prev = dev->current_step - 1;
    if (prev >= 0 && prev < dev->num_steps) {
        GteStep *step = &dev->steps[prev];
        if (step->pin_index >= 0 && step->pin_index < dev->num_drive_pins) {
            int gpio_pin = dev->drive_pins[step->pin_index];
            Esp32GpioState *gs = (Esp32GpioState *)dev->gpio;
            int bank = (gpio_pin >= 32) ? 1 : 0;
            int bit = gpio_pin & 31;
            bool before = (gs->in_val[bank] >> bit) & 1;
            esp32_gpio_set_input_level(dev->gpio, gpio_pin,
                                       step->pin_value != 0);
            bool after = (gs->in_val[bank] >> bit) & 1;
            /* Debug: log pin changes with virtual time + readback */
            if (dev->current_step <= 8 || dev->current_step == dev->num_steps) {
                uint64_t vt = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL);
                qemu_log("GTPE '%s': step[%d] → GPIO%d = %d "
                         "(before=%d after=%d in_val=0x%08x vtime=%"PRIu64"us)\n",
                         dev->name, prev, gpio_pin, step->pin_value,
                         before, after, gs->in_val[bank], vt / 1000);
            }
            gte_emit_waveform(dev, step->pin_index,
                              step->pin_value ? 1 : 0,
                              "edge",
                              step->pin_value ? "rising" : "falling",
                              NULL);
        } else {
            qemu_log("GTPE '%s': step[%d] pin_index=%d OUT OF RANGE (num_drive=%d)\n",
                     dev->name, prev, step->pin_index, dev->num_drive_pins);
        }
    }

    /* Continue to next step */
    gte_execute_step(dev);
}

/* ── Trigger Detection ───────────────────────────────────────────────────── */

static void gte_trigger_cb(void *opaque, int pin, bool high)
{
    GteDevice *dev = (GteDevice *)opaque;

    if (dev->bidirectional) {
        /* DHT11-style: firmware pulls LOW then releases HIGH */
        if (!high && !dev->pin_was_low && !dev->active) {
            dev->pin_was_low = true;
        } else if (high && dev->pin_was_low && !dev->active) {
            dev->pin_was_low = false;
            dev->trigger_count++;
            gte_emit_waveform(dev, 0, -1, "trigger", "none", dev->name);
            /* Build timeline with relative offsets (start_ns=0).
             * Will be anchored to real time on the first GPIO_IN read. */
            gte_encode_data(dev);
            dev->current_bit = 0;
            dev->active = true;
            dev->pending_response = true;
            gte_build_timeline(dev, 0); /* relative offsets */
            qemu_log("GTPE '%s': response prepared (%d entries, "
                     "%"PRIu64"us duration)\n",
                     dev->name, dev->timeline_count,
                     dev->timeline_count > 0
                         ? dev->timeline[dev->timeline_count - 1].time_ns / 1000
                         : 0);
        }
    } else {
        /* HC-SR04-style: rising edge on trigger pin */
        if (high && !dev->pin_was_high) {
            /* If previous response is still "active" but we got a new trigger,
             * the firmware has moved on (pulseIn returned or timed out).
             * Force-clear the stale active state. */
            if (dev->active) {
                dev->active = false;
                qemu_log("GTPE '%s': force-cleared stale active state\n",
                         dev->name);
            }
            dev->trigger_count++;
            gte_emit_waveform(dev, 0, -1, "trigger", "none", dev->name);
            gte_encode_data(dev);
            dev->current_bit = 0;
            dev->active = true;
            dev->pending_response = true;
            gte_build_timeline(dev, 0); /* relative offsets */
            qemu_log("GTPE '%s': trigger prepared (%d entries)\n",
                     dev->name, dev->timeline_count);
        }
        dev->pin_was_high = high;
    }
}

