yong1214/qemu-esp32/hw/gpio/gpio_timing_executor.c
/* ── JSON Parsing ────────────────────────────────────────────────────────── */

static GteEncoderType gte_parse_encoder(const char *name)
{
    if (!name) return GTE_ENCODER_NONE;
    if (g_strcmp0(name, "dht11_40bit") == 0) return GTE_ENCODER_DHT11_40BIT;
    if (g_strcmp0(name, "raw_pulse") == 0)   return GTE_ENCODER_RAW_PULSE;
    return GTE_ENCODER_NONE;
}

/**
 * Parse "pN * constant" expression string.
 * Returns true on success.
 */
static bool gte_parse_expr(const char *expr, GteDelayExpr *out)
{
    /* Format: "p<digit> * <number>" */
    if (!expr || expr[0] != 'p') return false;

    char *endptr;
    int idx = (int)strtol(expr + 1, &endptr, 10);
    if (idx < 0 || idx >= GTE_MAX_PARAMS) return false;

    /* Skip whitespace and '*' */
    while (*endptr == ' ' || *endptr == '*') endptr++;

    float mult = strtof(endptr, NULL);
    out->param_index = idx;
    out->multiplier = mult;
    return true;
}

/**
 * Resolve a pin name (e.g., "echo", "data") to a drive_pins index.
 */
static int gte_resolve_pin_name(GteDevice *dev, const char *name,
                                 const char **pin_names, int num_pins)
{
    for (int i = 0; i < num_pins; i++) {
        if (g_strcmp0(pin_names[i], name) == 0) return i;
    }
    return -1;
}

static int gte_parse_steps(QList *steps_list, GteDevice *dev,
                            const char **pin_names, int num_pin_names,
                            QDict *sequences, int start_idx)
{
    int idx = start_idx;
    QListEntry *entry;

    QLIST_FOREACH_ENTRY(steps_list, entry) {
        if (idx >= GTE_MAX_STEPS) break;

        QDict *step_dict = qobject_to(QDict, qlist_entry_obj(entry));
        if (!step_dict) continue;

        /* Check for comment-only entries (skip).
         * A step with BOTH "comment" and "repeat"/"set" is NOT comment-only. */
        if (qdict_haskey(step_dict, "comment")
            && !qdict_haskey(step_dict, "set")
            && !qdict_haskey(step_dict, "repeat")) {
            dev->steps[idx].type = GTE_STEP_COMMENT;
            dev->steps[idx].delay_ns = 0;
            idx++;
            continue;
        }

        /* Check for repeat block */
        if (qdict_haskey(step_dict, "repeat")) {
            /* "repeat" can be an integer count (e.g., 40) or a string
             * keyword (e.g., "encoded_bits" meaning repeat for each bit
             * from the data encoder).  Handle both safely. */
            QObject *repeat_obj = qdict_get(step_dict, "repeat");
            int repeat_count = 0;
            QNum *repeat_num = qobject_to(QNum, repeat_obj);
            QString *repeat_str = qobject_to(QString, repeat_obj);
            if (repeat_num) {
                repeat_count = (int)qnum_get_int(repeat_num);
            } else if (repeat_str) {
                const char *rstr = qstring_get_str(repeat_str);
                if (g_strcmp0(rstr, "encoded_bits") == 0) {
                    /* Sentinel: count determined at build-timeline time
                     * from the encoder output (e.g., 40 bits for DHT11) */
                    repeat_count = -1; /* -1 = encoded_bits marker */
                }
            }
            const char *seq_name = qdict_get_try_str(step_dict, "sequence");

            dev->steps[idx].type = GTE_STEP_REPEAT_START;
            dev->steps[idx].repeat_count = repeat_count;
            idx++;

            /* Inline the referenced sequence */
            if (seq_name && sequences) {
                QList *seq_list = qobject_to(QList, qdict_get(sequences, seq_name));
                if (seq_list) {
                    idx = gte_parse_steps(seq_list, dev, pin_names, num_pin_names,
                                          NULL, idx);
                }
            }

            dev->steps[idx].type = GTE_STEP_REPEAT_END;
            dev->steps[idx].repeat_jump_target = 0; /* set after full parse */
            idx++;
            continue;
        }

        /* Normal step: delay + set pin */
        const char *pin_name = qdict_get_try_str(step_dict, "set");
        int pin_idx = pin_name ? gte_resolve_pin_name(dev, pin_name,
                                                       pin_names, num_pin_names) : 0;

        int pin_val = 0;
        if (qdict_haskey(step_dict, "value")) {
            pin_val = (int)qdict_get_int(step_dict, "value");
        }

        GteStep *s = &dev->steps[idx];
        s->pin_index = pin_idx;
        s->pin_value = pin_val;

        if (qdict_haskey(step_dict, "delay_us_expr")) {
            const char *expr_str = qdict_get_str(step_dict, "delay_us_expr");
            s->type = GTE_STEP_SET_PIN_EXPR;
            if (!gte_parse_expr(expr_str, &s->delay_expr)) {
                qemu_log("GTPE: failed to parse expr: %s\n", expr_str);
                s->type = GTE_STEP_SET_PIN;
                s->delay_ns = 0;
            }
        } else if (qdict_haskey(step_dict, "delay_us_bit")) {
            QList *bit_list = qobject_to(QList, qdict_get(step_dict, "delay_us_bit"));
            s->type = GTE_STEP_SET_PIN_BIT;
            if (bit_list) {
                QNum *v0 = qobject_to(QNum, qlist_peek(bit_list));
                QNum *v1 = NULL;
                QListEntry *e2;
                int bi = 0;
                QLIST_FOREACH_ENTRY(bit_list, e2) {
                    QNum *n = qobject_to(QNum, qlist_entry_obj(e2));
                    if (n && bi < 2) {
                        int64_t us = qnum_get_int(n);
                        s->delay_bit[bi] = (uint64_t)us * 1000; /* µs → ns */
                        bi++;
                    }
                }
                (void)v0; (void)v1;
            }
        } else if (qdict_haskey(step_dict, "delay_us")) {
            QObject *delay_obj = qdict_get(step_dict, "delay_us");
            QNum *delay_num = qobject_to(QNum, delay_obj);
            if (delay_num) {
                int64_t us = qnum_get_int(delay_num);
                s->delay_ns = (uint64_t)us * 1000;
            } else {
                s->delay_ns = 0;
            }
            s->type = GTE_STEP_SET_PIN;
        } else {
            s->type = GTE_STEP_SET_PIN;
            s->delay_ns = 0;
        }

        idx++;
    }

