yong1214/qemu-esp32/hw/gpio/gpio_timing_executor.c
    return idx;
}

static bool gte_parse_one_device(QDict *dev_dict, GteDevice *dev,
                                  QDict *resolved_pins)
{
    memset(dev, 0, sizeof(*dev));

    /* Name */
    const char *name = qdict_get_try_str(dev_dict, "name");
    if (name) {
        g_strlcpy(dev->name, name, GTE_NAME_LEN);
    }

    /* Encoder — try "dataEncoder" first, then "encoder" */
    const char *enc = qdict_get_try_str(dev_dict, "dataEncoder");
    if (!enc) enc = qdict_get_try_str(dev_dict, "encoder");
    dev->encoder_type = gte_parse_encoder(enc);

    /* Waveform emission for oscilloscope */
    dev->emit_waveform = false;
    dev->trigger_count = 0;
    if (qdict_haskey(dev_dict, "emit_waveform")) {
        QObject *ew = qdict_get(dev_dict, "emit_waveform");
        if (ew) {
            QBool *ewb = qobject_to(QBool, ew);
            if (ewb) {
                dev->emit_waveform = qbool_get_bool(ewb);
            } else {
                /* Fallback: treat any truthy value (e.g., QNum 1) as true */
                QNum *ewn = qobject_to(QNum, ew);
                if (ewn) {
                    dev->emit_waveform = (qnum_get_int(ewn) != 0);
                }
            }
        }
    }

    /* Pins */
    QDict *pins_dict = qobject_to(QDict, qdict_get(dev_dict, "pins"));
    if (!pins_dict) return false;

    /* Collect pin names — we need TWO arrays:
     *   pin_names[]       — ALL pin names (watch + drive), for reference
     *   drive_pin_names[] — only DRIVE pin names, indexed to match drive_pins[]
     * Steps reference pins by name via "set": "echo", and the resolved index
     * must map to drive_pins[], not pin_names[]. */
    const char *pin_names[GTE_MAX_DRIVE_PINS * 2];
    int num_pin_names = 0;
    const char *drive_pin_names[GTE_MAX_DRIVE_PINS];
    int num_drive_pin_names = 0;

    const QDictEntry *pe;
    for (pe = qdict_first(pins_dict); pe; pe = qdict_next(pins_dict, pe)) {
        if (num_pin_names >= GTE_MAX_DRIVE_PINS * 2) break;
        const char *pname = qdict_entry_key(pe);
        QDict *pconf = qobject_to(QDict, qdict_entry_value(pe));
        if (!pconf) continue;

        pin_names[num_pin_names] = pname;

        const char *dir = qdict_get_try_str(pconf, "direction");

        /* Resolve actual GPIO pin number from resolvedPins */
        int gpio_num = -1;
        if (resolved_pins && qdict_haskey(resolved_pins, pname)) {
            gpio_num = (int)qdict_get_int(resolved_pins, pname);
        }

        if (dir && g_strcmp0(dir, "watch") == 0) {
            dev->watch_pin = gpio_num;
            const char *edge = qdict_get_try_str(pconf, "edge");
            dev->watch_rising = !edge || g_strcmp0(edge, "rising") == 0;
        } else if (dir && g_strcmp0(dir, "drive") == 0) {
            int di = dev->num_drive_pins;
            dev->drive_pins[di] = gpio_num;
            drive_pin_names[num_drive_pin_names++] = pname;
            /* Parse idle value */
            if (qdict_haskey(pconf, "idle")) {
                dev->idle_values[di] = (int)qdict_get_int(pconf, "idle");
            }
            dev->num_drive_pins++;
        } else if (dir && g_strcmp0(dir, "bidirectional") == 0) {
            /* Same pin for watch and drive */
            dev->watch_pin = gpio_num;
            dev->bidirectional = true;
            const char *wedge = qdict_get_try_str(pconf, "watch_edge");
            dev->watch_rising = wedge && g_strcmp0(wedge, "rising") == 0;

            int di = dev->num_drive_pins;
            dev->drive_pins[di] = gpio_num;
            drive_pin_names[num_drive_pin_names++] = pname;
            if (qdict_haskey(pconf, "idle")) {
                dev->idle_values[di] = (int)qdict_get_int(pconf, "idle");
            }
            dev->num_drive_pins++;
        }

        num_pin_names++;
    }

    /* Params */
    QList *params_list = qobject_to(QList, qdict_get(dev_dict, "params"));
    if (params_list) {
        QListEntry *entry;
        QLIST_FOREACH_ENTRY(params_list, entry) {
            QDict *pd = qobject_to(QDict, qlist_entry_obj(entry));
            if (!pd) continue;
            int idx = (int)qdict_get_int(pd, "index");
            if (idx >= 0 && idx < GTE_MAX_PARAMS) {
                /* Try to get 'default' as number */
                QNum *def_num = qobject_to(QNum, qdict_get(pd, "default"));
                if (def_num) {
                    double val = qnum_get_double(def_num);
                    dev->params[idx] = (float)val;
                }
                if (idx >= dev->num_params) dev->num_params = idx + 1;
            }
        }
    }

    /* Parse on_trigger steps — use drive_pin_names so that "set": "echo"
     * resolves to drive_pins[0], not pin_names[1] */
    QList *on_trigger = qobject_to(QList, qdict_get(dev_dict, "on_trigger"));
    if (on_trigger) {
        dev->num_steps = gte_parse_steps(on_trigger, dev, drive_pin_names,
                                          num_drive_pin_names, dev_dict, 0);
    }

    /* Parse end_sequence if present (appended after main steps) */
    QList *end_seq = qobject_to(QList, qdict_get(dev_dict, "end_sequence"));
    if (end_seq) {
        dev->num_steps = gte_parse_steps(end_seq, dev, drive_pin_names,
                                          num_drive_pin_names, NULL, dev->num_steps);
    }

    /* Create virtual-time timer */
    dev->step_timer = timer_new_ns(QEMU_CLOCK_VIRTUAL, gte_step_callback, dev);

    return true;
}

/* ── Public API ──────────────────────────────────────────────────────────── */

int gte_parse_scripts(const char *file_path, GteDevice devices[])
{
    Error *err = NULL;

/* Read JSON file */
    gchar *content = NULL;
    gsize length = 0;
    if (!g_file_get_contents(file_path, &content, &length, NULL)) {
        qemu_log("GTPE: failed to read file: %s\n", file_path);
        return -1;
    }

QObject *root = qobject_from_json(content, &err);
    g_free(content);

    if (!root || err) {
        qemu_log("GTPE: failed to parse JSON: %s\n",
                 err ? error_get_pretty(err) : "unknown");
        if (err) error_free(err);
        return -1;
    }

QList *scripts = qobject_to(QList, root);
    if (!scripts) {
        qemu_log("GTPE: JSON root is not an array\n");
        qobject_unref(root);
        return -1;
    }

    int count = 0;
    QListEntry *entry;
    QLIST_FOREACH_ENTRY(scripts, entry) {
        if (count >= GTE_MAX_DEVICES) break;

        QDict *dev_dict = qobject_to(QDict, qlist_entry_obj(entry));
        if (!dev_dict) continue;

        /* Get resolvedPins sub-object */
        QDict *resolved_pins = qobject_to(QDict, qdict_get(dev_dict, "resolvedPins"));

if (gte_parse_one_device(dev_dict, &devices[count], resolved_pins)) {
            devices[count].device_index = count;
            qemu_log("GTPE: parsed device '%s' (%d steps, %d params, waveform=%s)\n",
                     devices[count].name, devices[count].num_steps,
                     devices[count].num_params,
                     devices[count].emit_waveform ? "on" : "off");
            count++;
        }
    }

    qobject_unref(root);
    return count;
}

void gte_attach_gpio(GteDevice *dev, Esp32GpioState *gpio)
{
    if (!dev || !gpio) return;
    dev->gpio = gpio;

    if (dev->watch_pin >= 0) {
        esp32_gpio_register_output_listener(gpio, dev->watch_pin,
                                             gte_trigger_cb, dev);
    }

    /* Set initial idle state on drive pins */
    for (int i = 0; i < dev->num_drive_pins; i++) {
        if (dev->drive_pins[i] >= 0) {
            esp32_gpio_set_input_level(gpio, dev->drive_pins[i],
                                       dev->idle_values[i] != 0);
        }
    }

    qemu_log("GTPE: attached '%s' (watch=GPIO%d, drive=%d pins)\n",
             dev->name, dev->watch_pin, dev->num_drive_pins);
}

void gte_update_param(GteDevice *dev, int param_index, float value)
{
    if (!dev || param_index < 0 || param_index >= GTE_MAX_PARAMS) return;
    dev->params[param_index] = value;
    if (param_index >= dev->num_params) {
        dev->num_params = param_index + 1;
    }
}
